       IDENTIFICATION DIVISION.                                         00010001
       PROGRAM-ID. PGM05.                                               00020001
       ENVIRONMENT DIVISION.                                            00030001
       DATA DIVISION.                                                   00040001
       PROCEDURE DIVISION.                                              00050001
           DISPLAY 'HELLO WORLD'.                                       00060001
           STOP RUN.                                                    00070001