       IDENTIFICATION DIVISION.                                         00010001
       PROGRAM-ID. PGM03.                                               00020001
       ENVIRONMENT DIVISION.                                            00030001
       DATA DIVISION.                                                   00040001
       PROCEDURE DIVISION.                                              00060001
           DISPLAY 'HELLO WORLD'.                                       00070001
           STOP RUN.                                                    00080001