       IDENTIFICATION DIVISION.                                         00010000
       PROGRAM-ID. PGM13.                                               00020000
       ENVIRONMENT DIVISION.                                            00030000
       DATA DIVISION.                                                   00040000
       PROCEDURE DIVISION.                                              00050000
           DISPLAY 'HELLO WORLD'.                                       00060000
           STOP RUN.                                                    00070000